# ==========================Проблема 31==================================== DONE
# a = 'Google создаст специальную команду для поиска багов в особо важных приложениях'
# print(len(a))


# ==========================Проблема 25====================================
# a = "У вас есть строка 'Запуск Ethereum 2.0 состоится 1 декабря. На депозитный контракт внесено более 524 288 ETH'"
# b = a.split()
# for i in b:
#     print(type(b))
#
#
# ==========================Проблема 11====================================
# a = 'хакеры слили в сеть данные пакистанской энергетической компании k-Electric'
# print(a.upper())
#

# # ==========================Проблема 2====================================
# a = 'GitHub'
# b = input("Введите символ для разделения: ")
# print(a.split(b))

# ==========================Проблема 5====================================
# a = 'Ботнет IPStorm, в который ранее входили лишь Windows-машины, увеличился до 13 500 зараженных систем'
# print(a.replace('е', str(3)))

# ==========================Проблема 0====================================
a = 'Сьешь Еще Этих Мягких Французких Булочек Да Выйпей Чаю'
b = len(a) / 2
c = len(a)
print(a[0:int(b)].upper(), a[int(b):int(c)].lower())

# ==========================Проблема 1====================================
# a = True
# print(str(a))
